# SetDatumSlabComponent

## Description
Sets the datum slab component of an object.

```pascal
PROCEDURE SetDatumSlabComponent(
				obj                : HANDLE;
				datumSlabComponent : INTEGER);
```

```python
def vs.SetDatumSlabComponent(obj, datumSlabComponent):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|obj|HANDLE|The object. Can be a slab, Slab Style, or the Slab Preferences.|
|datumSlabComponent|INTEGER|The index of the datum slab component.|

## See Also
VS Functions:
GetDatumSlabComponent

## Version
Availability: from Vectorworks 2011

## Category
* Objects - Architectural